Revit 2027 API
StairsPathType.DrawForEachRun Property
 True if stairs paths should be drawn for each run, false if it should be drawn for the whole stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool DrawForEachRun { get; set; }
Public Property DrawForEachRun As Boolean
	Get
	Set
public:
property bool DrawForEachRun {
	bool get ();
	void set (bool value);
}
member DrawForEachRun : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: The StairsPathType is not fixed up direction so the data being set is not applicable.
See Also
Reference
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace